import React from 'react';
import classes from './Inbox.module.css';
import ElementMessage from '../UI/Elements/ElementMessage/ElementMessage'

const Inbox = () => {

    const messages = [
        {
            name: "Andrea",
            theme: "Партнерство",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        },
        {
            name: "Andrea",
            theme: "Партнерство",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        },
        {
            name: "Andrea",
            theme: "Партнерство",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        },
        {
            name: "Andrea",
            theme: "Партнерство",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        },
        {
            name: "Andrea",
            theme: "Партнерство",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        },
        {
            name: "Andrea Overdovermoverpower",
            theme: "Потенційні клієнти",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        },
        {
            name: "Andrea Overdovermoverpower",
            theme: "Потенційні клієнти",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        },
        {
            name: "Andrea Overdovermoverpower",
            theme: "Потенційні клієнти",
            text: "Якесь повідомлення якесь повідомлення якесь повідомленняякесь повідомлення якесь повідомлення якесь повідомлення якесь повідомлення якесь повідомленн...",
            date: "23.33.22"
        }
    ]

    return (
                <div className={classes.messagesListContainer}>
                    {messages.map((message) => (
                        <ElementMessage name={message.name} theme={message.theme} text={message.text} date={message.date}></ElementMessage>
                        ))}
                </div>

    );
};

export default Inbox;