import React from 'react';
import Navbar from "../../../UI/Navbar/Navbar";
import classes from  "./LogoNews.module.css"
import CarrouselNews from "./UI/CarrouselNews/CarrouselNews";
const LogoNews = () => {
    const mockedItems = [
        { id: 1,
            title:"КАНАДА СПРИЯЄ СВОЄЧАСНІЙ ПІСЛЯОПЕРАЦІЙНІЙ РЕАБІЛІТАЦІЇ УКРАЇНЦІВ, ЯКІ ВТРАТИЛИ КІНЦІВКИ.",
            description: "За сприяння Канадського фонду місцевих ініціатив " +
                "було зібрано та передано 2000 рюкзаків для осіб з ампутацією кінцівки, а також створено онлайн групу підтримки.\n",
        },     { id: 2,
            title:"КАНАДА СПРИЯЄ СВОЄЧАСНІЙ ПІСЛЯОПЕРАЦІЙНІЙ РЕАБІЛІТАЦІЇ УКРАЇНЦІВ, ЯКІ ВТРАТИЛИ КІНЦІВКИ.",
            description: "За сприяння Канадського фонду місцевих ініціатив " +
                "було зібрано та передано 2000 рюкзаків для осіб з ампутацією кінцівки, а також створено онлайн групу підтримки.\n",
        },     { id: 3,
            title:"3КАНАДА СПРИЯЄ СВОЄЧАСНІЙ ПІСЛЯОПЕРАЦІЙНІЙ РЕАБІЛІТАЦІЇ УКРАЇНЦІВ, ЯКІ ВТРАТИЛИ КІНЦІВКИ.",
            description: "За сприяння Канадського фонду місцевих ініціатив " +
                "було зібрано та передано 2000 рюкзаків для осіб з ампутацією кінцівки, а також створено онлайн групу підтримки.\n",
        },     { id: 4,
            title:"4КАНАДА СПРИЯЄ СВОЄЧАСНІЙ ПІСЛЯОПЕРАЦІЙНІЙ РЕАБІЛІТАЦІЇ УКРАЇНЦІВ, ЯКІ ВТРАТИЛИ КІНЦІВКИ.",
            description: "За сприяння Канадського фонду місцевих ініціатив " +
                "було зібрано та передано 2000 рюкзаків для осіб з ампутацією кінцівки, а також створено онлайн групу підтримки.\n",
        },

    ];

    return (

        <div className={classes.rectangle}>
            <Navbar></Navbar>
            <div className={classes.container}>
            <div className={classes.icon}>
            </div>
            <CarrouselNews mockedItems={mockedItems}>

            </CarrouselNews>


            </div>
        </div>

    );
};

export default LogoNews;