import React from 'react';
import classes from './StoriesBlock.module.css';
import ContentBlock from '../../../UI/components/ContentBlock/ContentBlock';

const StoriesBlock = () => {
    return (
        <div className={classes.block}>
            <div className={classes.box}>
                <div className={classes.content}>

                    <ContentBlock header={"ОКСАНА НЕЖАЛЬСЬКА. ТРАВМА – НЕ ВИРОК. ІСТОРІЯ ЖИТТЯ З ПРОТЕЗОМ"}
                                  text1={"У 2014-ому, Оксана їхала автомобілем у Луганській області та натрапила на міну. Внаслідок вибуху Оксана втратила ноги."}
                                  text2={"Первинну реабілітацію та перше протезування робила у Харкові. Процес реабілітації тоді зайняв близько 1.5 місяця. Донька Оксани дуже підтримувала її під час реабілітації. У 2016-ому Оксана була учасницею Проекту Підтримки Протезування в Україні, де з нею працювала британська фізіотерапевт, Лора Берджес."}/>
                    <ContentBlock header={"ОКСАНА НЕЖАЛЬСЬКА. ТРАВМА – НЕ ВИРОК. ІСТОРІЯ ЖИТТЯ З ПРОТЕЗОМ"}
                                  text1={"У 2014-ому, Оксана їхала автомобілем у Луганській області та натрапила на міну. Внаслідок вибуху Оксана втратила ноги."}
                                  text2={"Первинну реабілітацію та перше протезування робила у Харкові. Процес реабілітації тоді зайняв близько 1.5 місяця. Донька Оксани дуже підтримувала її під час реабілітації. У 2016-ому Оксана була учасницею Проекту Підтримки Протезування в Україні, де з нею працювала британська фізіотерапевт, Лора Берджес."}/>
                    <ContentBlock header={"ОКСАНА НЕЖАЛЬСЬКА. ТРАВМА – НЕ ВИРОК. ІСТОРІЯ ЖИТТЯ З ПРОТЕЗОМ"}
                                  text1={"У 2014-ому, Оксана їхала автомобілем у Луганській області та натрапила на міну. Внаслідок вибуху Оксана втратила ноги."}
                                  text2={"Первинну реабілітацію та перше протезування робила у Харкові. Процес реабілітації тоді зайняв близько 1.5 місяця. Донька Оксани дуже підтримувала її під час реабілітації. У 2016-ому Оксана була учасницею Проекту Підтримки Протезування в Україні, де з нею працювала британська фізіотерапевт, Лора Берджес."}/>
                </div>
                <div className={classes.nextFrame}>
                    <div className={classes.more}>
                        <div className={classes.textWrapper3}>Більше</div>
                        <svg width="110" height="25" viewBox="0 0 110 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M-4.82984e-07 12.2492L107.5 12.25M107.5 12.25L97.75 0.999973M107.5 12.25L97.75 23.2986"
                              stroke="#2D3361" stroke-width="3"/>
                        </svg>
                    </div>
                </div>
            </div>
            <div className={classes.scroll}></div>

        </div>
    );
};

export default StoriesBlock;