import React from 'react';
import classes from './AboutUs.module.css';
const AboutUs = () => {
    return (
        <div className={classes.aboutUsGeneral}>
            <div className={classes.aboutUsSubGeneral}>
                <div className={`${classes.aboutUsRegion} ${classes.patientsRegion}`}>
                    <div className={classes.aboutUsSubBlocks}>
                        <span className={`${classes.spanTitleLayout} ${classes.spanTitle1}`}>про нас говорять:</span>
                        <shape className={classes.aboutUsPhotoFrame1}></shape>
                    </div>

                    <div className={classes.aboutUsSubBlocks}>
                        <span className={`${classes.spanTitleLayout} ${classes.spanTitle2}`}>наші пацієнти</span>
                        <svg xmlns="http://www.w3.org/2000/svg" className={classes.quoteSvg} width="37" height="32" viewBox="0 0 37 32" fill="none">
                            <path d="M0 2.90909L10.8934 0L18.6878 29.0909L7.79442 32L0 2.90909ZM18.2183 2.90909L29.2056 0L37 29.0909L26.0127 32L18.2183 2.90909Z" fill="#2D3361"/>
                        </svg>
                        <span className={`${classes.spanParagraphLayout1} ${classes.spanParagraph1}`}>
                            Екскурсії для навчальних закладів,
                            можливість відвідати центр. Екскурсії для навчальних закладів, можливість відвідати центр і так далі тому подібне.
                            Екскурсії для навчальних закладів,
                            можливість відвідати центр. Екскурсії для навчальних закладів, можливість відвідати центр і так далі тому подібне.
                        </span>
                        <svg className={classes.cardsBarSvg} width="333" height="72" viewBox="0 0 333 72" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M51.1494 36.1007L2 36.1007M2 36.1007L11.75 24.8507M2 36.1007L11.75 47.1493" stroke="#2D3361" stroke-width="3"/>
                            <mask id="path-2-outside-1_249_1596" maskUnits="userSpaceOnUse" x="66.1494" y="11" width="90" height="44" fill="black">
                                <rect fill="white" x="66.1494" y="11" width="90" height="44"/>
                                <path d="M80.9494 53.76C71.6374 51.84 68.0854 43.776 68.0854 33.216C68.0854 22.608 71.6374 14.64 80.9494 12.72V16.176C74.3254 17.856 71.8774 24.096 71.8774 33.216C71.8774 42.336 74.3254 48.624 80.9494 50.304V53.76ZM101.915 29.04C108.347 26.448 110.555 20.928 110.651 14.16H119.339V48H114.971V18.48L115.691 15.36H114.491C114.011 22.944 111.851 29.952 103.259 32.736L101.915 29.04ZM141.63 12.72C150.942 14.64 154.494 22.704 154.494 33.264C154.494 43.872 150.942 51.84 141.63 53.76V50.304C148.254 48.624 150.702 42.384 150.702 33.264C150.702 24.144 148.254 17.856 141.63 16.176V12.72Z"/>
                            </mask>
                            <path d="M80.9494 53.76C71.6374 51.84 68.0854 43.776 68.0854 33.216C68.0854 22.608 71.6374 14.64 80.9494 12.72V16.176C74.3254 17.856 71.8774 24.096 71.8774 33.216C71.8774 42.336 74.3254 48.624 80.9494 50.304V53.76ZM101.915 29.04C108.347 26.448 110.555 20.928 110.651 14.16H119.339V48H114.971V18.48L115.691 15.36H114.491C114.011 22.944 111.851 29.952 103.259 32.736L101.915 29.04ZM141.63 12.72C150.942 14.64 154.494 22.704 154.494 33.264C154.494 43.872 150.942 51.84 141.63 53.76V50.304C148.254 48.624 150.702 42.384 150.702 33.264C150.702 24.144 148.254 17.856 141.63 16.176V12.72Z" fill="#2D3361"/>
                            <path d="M80.9494 53.76L80.7475 54.7394L81.9494 54.9872V53.76H80.9494ZM80.9494 12.72H81.9494V11.4928L80.7475 11.7406L80.9494 12.72ZM80.9494 16.176L81.1953 17.1453L81.9494 16.954V16.176H80.9494ZM80.9494 50.304H81.9494V49.526L81.1953 49.3347L80.9494 50.304ZM81.1514 52.7806C76.777 51.8787 73.8028 49.5588 71.8928 46.2303C69.9603 42.8627 69.0854 38.4014 69.0854 33.216H67.0854C67.0854 38.5906 67.9865 43.4413 70.1581 47.2257C72.3521 51.0492 75.8098 53.7213 80.7475 54.7394L81.1514 52.7806ZM69.0854 33.216C69.0854 28.0059 69.9606 23.5579 71.8917 20.2096C73.7999 16.9009 76.7731 14.6021 81.1514 13.6994L80.7475 11.7406C75.8137 12.7579 72.3549 15.4031 70.1592 19.2104C67.9862 22.9781 67.0854 27.8181 67.0854 33.216H69.0854ZM79.9494 12.72V16.176H81.9494V12.72H79.9494ZM80.7036 15.2067C77.0901 16.1231 74.5942 18.308 73.0331 21.4625C71.4951 24.5706 70.8774 28.5875 70.8774 33.216H72.8774C72.8774 28.7245 73.4837 25.0614 74.8257 22.3495C76.1447 19.684 78.1847 17.9089 81.1953 17.1453L80.7036 15.2067ZM70.8774 33.216C70.8774 37.8447 71.4952 41.8727 73.0324 44.9921C74.5923 48.1573 77.0875 50.3562 80.7036 51.2733L81.1953 49.3347C78.1873 48.5718 76.1465 46.7867 74.8264 44.108C73.4836 41.3833 72.8774 37.7073 72.8774 33.216H70.8774ZM79.9494 50.304V53.76H81.9494V50.304H79.9494ZM101.915 29.04L101.542 28.1125L100.645 28.4736L100.975 29.3817L101.915 29.04ZM110.651 14.16V13.16H109.665L109.651 14.1458L110.651 14.16ZM119.339 14.16H120.339V13.16H119.339V14.16ZM119.339 48V49H120.339V48H119.339ZM114.971 48H113.971V49H114.971V48ZM114.971 18.48L113.997 18.2551L113.971 18.3661V18.48H114.971ZM115.691 15.36L116.666 15.5849L116.948 14.36H115.691V15.36ZM114.491 15.36V14.36H113.553L113.493 15.2968L114.491 15.36ZM103.259 32.736L102.319 33.0777L102.649 33.9848L103.568 33.6873L103.259 32.736ZM102.289 29.9675C105.716 28.5866 108.059 26.4011 109.54 23.6387C111.01 20.8994 111.602 17.6529 111.651 14.1742L109.651 14.1458C109.605 17.4351 109.045 20.3326 107.778 22.6933C106.524 25.0309 104.547 26.9014 101.542 28.1125L102.289 29.9675ZM110.651 15.16H119.339V13.16H110.651V15.16ZM118.339 14.16V48H120.339V14.16H118.339ZM119.339 47H114.971V49H119.339V47ZM115.971 48V18.48H113.971V48H115.971ZM115.946 18.7049L116.666 15.5849L114.717 15.1351L113.997 18.2551L115.946 18.7049ZM115.691 14.36H114.491V16.36H115.691V14.36ZM113.493 15.2968C113.257 19.0312 112.611 22.5076 111.041 25.3666C109.491 28.1882 107.008 30.4701 102.951 31.7847L103.568 33.6873C108.103 32.2179 110.995 29.6038 112.794 26.3294C114.572 23.0924 115.246 19.2728 115.489 15.4232L113.493 15.2968ZM104.199 32.3943L102.855 28.6983L100.975 29.3817L102.319 33.0777L104.199 32.3943ZM141.63 12.72L141.832 11.7406L140.63 11.4928V12.72H141.63ZM141.63 53.76H140.63V54.9872L141.832 54.7394L141.63 53.76ZM141.63 50.304L141.384 49.3347L140.63 49.526V50.304H141.63ZM141.63 16.176H140.63V16.954L141.384 17.1453L141.63 16.176ZM141.428 13.6994C145.802 14.6013 148.776 16.9212 150.686 20.2497C152.619 23.6173 153.494 28.0786 153.494 33.264H155.494C155.494 27.8894 154.593 23.0387 152.421 19.2543C150.227 15.4308 146.769 12.7587 141.832 11.7406L141.428 13.6994ZM153.494 33.264C153.494 38.4741 152.618 42.9221 150.687 46.2704C148.779 49.5791 145.806 51.8779 141.428 52.7806L141.832 54.7394C146.765 53.7221 150.224 51.0769 152.42 47.2696C154.593 43.5019 155.494 38.6619 155.494 33.264H153.494ZM142.63 53.76V50.304H140.63V53.76H142.63ZM141.876 51.2733C145.489 50.3569 147.985 48.172 149.546 45.0175C151.084 41.9094 151.702 37.8925 151.702 33.264H149.702C149.702 37.7555 149.095 41.4186 147.753 44.1305C146.434 46.796 144.394 48.5711 141.384 49.3347L141.876 51.2733ZM151.702 33.264C151.702 28.6353 151.084 24.6073 149.547 21.4879C147.987 18.3227 145.492 16.1238 141.876 15.2067L141.384 17.1453C144.392 17.9082 146.433 19.6933 147.753 22.372C149.095 25.0967 149.702 28.7727 149.702 33.264H151.702ZM142.63 16.176V12.72H140.63V16.176H142.63Z" fill="#2D3361" mask="url(#path-2-outside-1_249_1596)"/>
                            <path d="M172.781 35.52C172.781 27.216 177.341 23.952 183.101 23.952C188.237 23.952 191.789 26.736 191.789 31.968C191.789 39.552 184.109 42.912 174.077 44.592V45.552L176.429 44.928H191.789V48H173.117V41.808C175.469 41.472 188.285 39.648 188.285 31.92C188.285 28.848 186.605 27.024 183.101 27.024C179.021 27.024 176.285 29.232 176.285 35.52H172.781ZM213.434 38.976C213.434 43.68 215.546 45.264 219.866 45.264C223.754 45.264 225.578 43.776 225.578 40.944C225.578 38.208 223.994 37.056 221.45 37.056H218.234V34.176H221.45C223.994 34.176 225.242 33.072 225.242 30.912C225.242 28.608 223.802 27.024 219.866 27.024C215.594 27.024 213.77 28.608 213.77 32.112H210.266C210.266 26.592 213.962 23.952 219.962 23.952C225.578 23.952 228.746 26.448 228.746 30.192C228.746 33.264 226.97 34.656 223.946 35.136V36.096C226.922 36.624 229.082 37.728 229.082 41.52C229.082 45.888 225.53 48.336 219.962 48.336C213.914 48.336 209.93 45.696 209.93 38.976H213.434ZM247.693 36.768C253.069 34.896 257.197 30.576 257.773 24.288H261.277C260.653 31.2 256.717 36.72 248.653 39.744V40.656L251.005 40.08H260.029V32.496H263.581V40.08H266.461V43.152H263.581V48H260.029V43.152H247.693V36.768Z" fill="#8C96C1"/>
                            <path d="M281.149 36.1007L330.299 36.1007M330.299 36.1007L320.549 24.8507M330.299 36.1007L320.549 47.1493" stroke="#2D3361" stroke-width="3"/>
                        </svg>
                    </div>
                </div>
                <div className={`${classes.aboutUsRegion} ${classes.mediaRegion}`}>
                    <div className={classes.aboutUsSubBlocks}>
                        <span className={`${classes.spanTitleLayout} ${classes.spanTitle3}`}>медіа</span>
                        <span className={`${classes.spanParagraphTitleLayout} ${classes.spanParagraphTitle1}`}>Заголовок статті про центр протезування</span>
                        <span className={`${classes.spanParagraphLayout2} ${classes.spanParagraph2}`}>Екскурсії для навчальних закладів,
                                        можливість відвідати центр. Екскурсії для навчальних закладів,
                                        можливість відвідати центр і так далі тому подібне.
                        </span>
                        <span className={`${classes.spanParagraphLayout2} ${classes.spanParagraph3}`}>Екскурсії для навчальних закладів,
                                        можливість відвідати центр. Екскурсії для навчальних закладів,
                                        можливість відвідати центр і так далі тому подібне.
                        </span>
                        <shape className={classes.aboutUsPhotoFrame2}></shape>
                    </div>

                    <div className={`${classes.aboutUsSubBlocks} ${classes.aboutUsMediaRegionSubBlockLeft}`}>
                        <div className={`${classes.aboutUsSubBlocks} ${classes.aboutUsSuperSubBlocks} ${classes.aboutUsSuperSubBlocksColored1}`}>
                            <span className={`${classes.spanParagraphTitleLayout} ${classes.spanParagraphTitle2}`}>Заголовок статті про центр протезування</span>
                            <span className={`${classes.spanParagraphLayout2} ${classes.spanParagraph4}`}>Екскурсії для навчальних закладів,
                                        можливість відвідати центр. Екскурсії для навчальних закладів,
                                        можливість відвідати центр і так далі тому подібне.
                            </span>
                        </div>
                        <div className={`${classes.aboutUsSubBlocks} ${classes.aboutUsSuperSubBlocks}`}>
                            <span className={`${classes.spanParagraphTitleLayout} ${classes.spanParagraphTitle2}`}>Заголовок статті про центр протезування</span>
                            <span className={`${classes.spanParagraphLayout2} ${classes.spanParagraph4}`}>Екскурсії для навчальних закладів,
                                        можливість відвідати центр. Екскурсії для навчальних закладів,
                                        можливість відвідати центр і так далі тому подібне.
                            </span>
                        </div>
                        <div className={`${classes.aboutUsSubBlocks} ${classes.aboutUsSuperSubBlocks}`}>
                            <span className={`${classes.spanParagraphTitleLayout} ${classes.spanParagraphTitle2}`}>Заголовок статті про центр протезування</span>
                            <span className={`${classes.spanParagraphLayout2} ${classes.spanParagraph4}`}>Екскурсії для навчальних закладів,
                                        можливість відвідати центр. Екскурсії для навчальних закладів,
                                        можливість відвідати центр і так далі тому подібне.
                            </span>
                        </div>
                        <div className={`${classes.aboutUsSubBlocks} ${classes.aboutUsSuperSubBlocksExeption1}`}>
                            <span className={`${classes.spanParagraphTitleLayout} ${classes.spanParagraphTitle3}`}>Заголовок статті про центр протезування</span>
                            <span className={`${classes.spanParagraphLayout2} ${classes.spanParagraph4}`}>Екскурсії для навчальних закладів,
                                        можливість відвідати центр. Екскурсії для навчальних закладів,
                                        можливість відвідати центр і так далі тому подібне.
                            </span>
                        </div>
                    </div>

                </div>
            </div>

        </div>
    );
};

export default AboutUs;